#    -*- mode: org -*-


Archived entries from file c:/Users/tyler/AppData/Roaming/Orgfiles/SEAS.org


* DONE Create task list for day
CLOSED: [2022-12-19 Mon 16:49] SCHEDULED: <2022-12-19 Mon 11:35>
:PROPERTIES:
:ARCHIVE_TIME: 2022-12-20 Tue 14:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: tasks
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS @office
:END:
:LOGBOOK:
CLOCK: [2022-12-19 Mon 11:36]--[2022-12-19 Mon 12:10] =>  0:34
:END:
 [2022-12-19 Mon 11:35]
 [[file:~/Orgfiles/SEAS.org::*Build Email for gear sales][Build Email for gear sales]]


* DONE Build Email for gear sales
CLOSED: [2022-12-19 Mon 16:49] SCHEDULED: <2022-12-19 Mon 11:45>
:PROPERTIES:
:ARCHIVE_TIME: 2022-12-20 Tue 14:26
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: tasks
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS @office
:END:
:LOGBOOK:
CLOCK: [2022-12-19 Mon 12:10]--[2022-12-19 Mon 16:13] =>  4:03
CLOCK: [2022-12-19 Mon 11:35]--[2022-12-19 Mon 11:35] =>  0:00
:END:
 [2022-12-19 Mon 11:34]


* DONE Read & Catch up on News
CLOSED: [2023-01-18 Wed 11:22] SCHEDULED: <2023-01-18 Wed 10:45>
:PROPERTIES:
:Effort:   30
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 10:46]--[2023-01-18 Wed 11:22] =>  0:36
:END:
 [2023-01-18 Wed 10:44]


* DONE Lunch Break
CLOSED: [2023-01-18 Wed 15:11] SCHEDULED: <2023-01-18 Wed 13:30>
:PROPERTIES:
:Effort:   60
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 15:10]--[2023-01-18 Wed 15:10] =>  0:00
CLOCK: [2023-01-18 Wed 15:10]--[2023-01-18 Wed 15:10] =>  0:00
:END:
 [2023-01-18 Wed 11:50]


* DONE Plan Remainder of week and next weeks tasks
CLOSED: [2023-01-18 Wed 15:10] SCHEDULED: <2023-01-18 Wed 12:00>
:PROPERTIES:
:Effort:   1:30
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 13:46]--[2023-01-18 Wed 14:02] =>  0:16
CLOCK: [2023-01-18 Wed 13:04]--[2023-01-18 Wed 13:04] =>  0:00
CLOCK: [2023-01-18 Wed 12:51]--[2023-01-18 Wed 12:56] =>  0:05
CLOCK: [2023-01-18 Wed 11:58]--[2023-01-18 Wed 12:51] =>  0:53
:END:
 [2023-01-18 Wed 11:51]
 [[file:~/Orgfiles/SEAS.org::*Lunch Break][Lunch Break]]


* DONE Create SEAS news letter in Mailchimp
CLOSED: [2023-01-19 Thu 16:37] SCHEDULED: <2023-01-19 Thu 10:00>
:PROPERTIES:
:Effort:   1:30
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-19 Thu 11:26]--[2023-01-19 Thu 16:37] =>  5:11
:END:
 [2023-01-18 Wed 13:07]


* DONE Get News Letter Approved by Zack
CLOSED: [2023-01-20 Fri 15:03] SCHEDULED: <2023-01-20 Fri 11:30>
:PROPERTIES:
:Effort:   30
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-20 Fri 12:36]--[2023-01-20 Fri 12:57] =>  0:21
CLOCK: [2023-01-20 Fri 11:25]--[2023-01-20 Fri 11:30] =>  0:05
CLOCK: [2023-01-19 Thu 16:37]--[2023-01-19 Thu 16:47] =>  0:10
:END:
 [2023-01-18 Wed 13:08]


* DONE Confirm server room has a slot for the cienna to move to
CLOSED: [2023-01-18 Wed 15:32] SCHEDULED: <2023-01-18 Wed 14:15>
:PROPERTIES:
:Effort:   15
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 15:26]--[2023-01-18 Wed 15:32] =>  0:06
:END:
 [2023-01-18 Wed 13:13]


* DONE Clean up Gmail
CLOSED: [2023-01-18 Wed 17:04] SCHEDULED: <2023-01-18 Wed 16:45>
:PROPERTIES:
:Effort:   1:15
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 16:54]--[2023-01-18 Wed 17:04] =>  0:10
:END:
 [2023-01-18 Wed 13:14]


* DONE Schedule the week
CLOSED: [2023-01-23 Mon 14:40] SCHEDULED: <2023-01-23 Mon 13:45>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-23 Mon 13:52]--[2023-01-23 Mon 14:38] =>  0:46
CLOCK: [2023-01-23 Mon 13:40]--[2023-01-23 Mon 13:52] =>  0:12
:END:
 [2023-01-23 Mon 13:39]


* DONE Migrate tasks from SEAS Notion into org
CLOSED: [2023-01-23 Mon 16:34] SCHEDULED: <2023-01-23 Mon 15:30>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-23 Mon 15:59]--[2023-01-23 Mon 16:34] =>  0:35
CLOCK: [2023-01-23 Mon 15:32]--[2023-01-23 Mon 15:57] =>  0:25
:END:
 [2023-01-23 Mon 14:38]


* DONE Meet with Bridge-Rev 
CLOSED: [2023-01-24 Tue 16:07] SCHEDULED: <2023-01-24 Tue 12:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-24 Tue 12:28]--[2023-01-24 Tue 12:28] =>  0:00
:END:
 [2023-01-23 Mon 15:59]
 


* MEETING with Matt                                                 :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-03-01 Wed 12:30
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-30 Mon 12:39]--[2023-01-30 Mon 13:13] =>  0:34
:END:
[2023-01-30 Mon 12:39]


Nextcloud.com to look into the dropbox style setup.
Bridged nics need to be onsite and/or dashboard access from ryan. 

* DONE Read & Catch up on News
CLOSED: [2023-01-18 Wed 11:22] SCHEDULED: <2023-01-18 Wed 10:45>
:PROPERTIES:
:Effort:   30
:ARCHIVE_TIME: 2023-03-07 Tue 12:05
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 10:46]--[2023-01-18 Wed 11:22] =>  0:36
:END:
 [2023-01-18 Wed 10:44]


* DONE Lunch Break
CLOSED: [2023-01-18 Wed 15:11] SCHEDULED: <2023-01-18 Wed 13:30>
:PROPERTIES:
:Effort:   60
:ARCHIVE_TIME: 2023-03-07 Tue 12:05
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 15:10]--[2023-01-18 Wed 15:10] =>  0:00
CLOCK: [2023-01-18 Wed 15:10]--[2023-01-18 Wed 15:10] =>  0:00
:END:
 [2023-01-18 Wed 11:50]


* DONE Plan Remainder of week and next weeks tasks
CLOSED: [2023-01-18 Wed 15:10] SCHEDULED: <2023-01-18 Wed 12:00>
:PROPERTIES:
:Effort:   1:30
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 13:46]--[2023-01-18 Wed 14:02] =>  0:16
CLOCK: [2023-01-18 Wed 13:04]--[2023-01-18 Wed 13:04] =>  0:00
CLOCK: [2023-01-18 Wed 12:51]--[2023-01-18 Wed 12:56] =>  0:05
CLOCK: [2023-01-18 Wed 11:58]--[2023-01-18 Wed 12:51] =>  0:53
:END:
 [2023-01-18 Wed 11:51]
 [[file:~/Orgfiles/SEAS.org::*Lunch Break][Lunch Break]]


* DONE Create SEAS news letter in Mailchimp
CLOSED: [2023-01-19 Thu 16:37] SCHEDULED: <2023-01-19 Thu 10:00>
:PROPERTIES:
:Effort:   1:30
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-19 Thu 11:26]--[2023-01-19 Thu 16:37] =>  5:11
:END:
 [2023-01-18 Wed 13:07]


* DONE Get News Letter Approved by Zack
CLOSED: [2023-01-20 Fri 15:03] SCHEDULED: <2023-01-20 Fri 11:30>
:PROPERTIES:
:Effort:   30
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-20 Fri 12:36]--[2023-01-20 Fri 12:57] =>  0:21
CLOCK: [2023-01-20 Fri 11:25]--[2023-01-20 Fri 11:30] =>  0:05
CLOCK: [2023-01-19 Thu 16:37]--[2023-01-19 Thu 16:47] =>  0:10
:END:
 [2023-01-18 Wed 13:08]


* DONE Confirm server room has a slot for the cienna to move to
CLOSED: [2023-01-18 Wed 15:32] SCHEDULED: <2023-01-18 Wed 14:15>
:PROPERTIES:
:Effort:   15
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 15:26]--[2023-01-18 Wed 15:32] =>  0:06
:END:
 [2023-01-18 Wed 13:13]


* DONE Clean up Gmail
CLOSED: [2023-01-18 Wed 17:04] SCHEDULED: <2023-01-18 Wed 16:45>
:PROPERTIES:
:Effort:   1:15
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-18 Wed 16:54]--[2023-01-18 Wed 17:04] =>  0:10
:END:
 [2023-01-18 Wed 13:14]


* DONE Schedule the week
CLOSED: [2023-01-23 Mon 14:40] SCHEDULED: <2023-01-23 Mon 13:45>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-23 Mon 13:52]--[2023-01-23 Mon 14:38] =>  0:46
CLOCK: [2023-01-23 Mon 13:40]--[2023-01-23 Mon 13:52] =>  0:12
:END:
 [2023-01-23 Mon 13:39]


* DONE Migrate tasks from SEAS Notion into org
CLOSED: [2023-01-23 Mon 16:34] SCHEDULED: <2023-01-23 Mon 15:30>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-23 Mon 15:59]--[2023-01-23 Mon 16:34] =>  0:35
CLOCK: [2023-01-23 Mon 15:32]--[2023-01-23 Mon 15:57] =>  0:25
:END:
 [2023-01-23 Mon 14:38]


* DONE Meet with Bridge-Rev 
CLOSED: [2023-01-24 Tue 16:07] SCHEDULED: <2023-01-24 Tue 12:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-24 Tue 12:28]--[2023-01-24 Tue 12:28] =>  0:00
:END:
 [2023-01-23 Mon 15:59]
 


* MEETING with Matt                                                 :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-03-07 Tue 12:06
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-30 Mon 12:39]--[2023-01-30 Mon 13:13] =>  0:34
:END:
[2023-01-30 Mon 12:39]


Nextcloud.com to look into the dropbox style setup.
Bridged nics need to be onsite and/or dashboard access from ryan. 

** PHONE Mayitas Tacos                                               :PHONE:
:LOGBOOK:
CLOCK: [2023-01-26 Thu 14:08]--[2023-01-26 Thu 14:15] =>  0:07
:END:
[2023-01-26 Thu 14:08]

*Tacos & Salsa* 

$14 per person
 
Tacos w/ rice beans & salsa Horchata type drinks

Minimum is 50  ($750)

$75 for travel 

$15 per person


200 people.

Carne Asada
Chicken
 Al Pastor
 Chilorrio - shredded pork + red chile

 Alexander - 951-588-9190
 
* DONE Transfer video from Momentous Show (truck coming in)
CLOSED: [2023-02-02 Thu 11:09] SCHEDULED: <2023-01-31 Tue>
:PROPERTIES:
:Effort:   0:30
:ARCHIVE_TIME: 2023-04-05 Wed 11:37
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-01-30 Mon 12:28]--[2023-01-30 Mon 12:28] =>  0:00
:END:
 [2023-01-26 Thu 16:16]


* DONE Plan next 2 weeks
CLOSED: [2023-02-22 Wed 11:26] SCHEDULED: <2023-02-22 Wed 11:00>
:PROPERTIES:
:Effort:   0:30
:ARCHIVE_TIME: 2023-04-05 Wed 11:37
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-02-22 Wed 10:49]--[2023-02-22 Wed 11:26] =>  0:37
:END:
 [2023-02-22 Wed 10:49]



* MEETING with Bridge Rev                                           :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-04-05 Wed 14:55
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-02-14 Tue 13:20]--[2023-02-14 Tue 14:29] =>  1:09
:END:
[2023-02-14 Tue 13:20]

- COlumn width not changable
- Setup interlinking for asana
- More than 4 properties is not possible
- Biz Dev Pipeline - manual
- Probably best to build a new site instead of go with the old one
  

* MEETING with George                                               :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-06-01 Thu 11:31
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-04-26 Wed 16:30]--[2023-04-26 Wed 17:24] =>  0:54
:END:
[2023-04-26 Wed 16:29]

* MEETING with George                                               :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-06-10 Sat 15:21
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-04-26 Wed 16:30]--[2023-04-26 Wed 17:24] =>  0:54
:END:
[2023-04-26 Wed 16:29]

** DONE Add Hubspot embed code
CLOSED: [2023-01-30 Mon 14:55] SCHEDULED: <2023-01-30 Mon 15:00>
:PROPERTIES:
:Effort:   0:30
:END:
:LOGBOOK:
CLOCK: [2023-01-30 Mon 14:46]--[2023-01-30 Mon 14:55] =>  0:09
:END:
 [2023-01-26 Thu 12:00]

<!-- Start of HubSpot Embed Code -->
<script type="text/javascript" id="hs-script-loader" async defer src="//js.hs-scripts.com/23772871.js"></script>
<!-- End of HubSpot Embed Code -->

[[https://t.sidekickopen84.com/s3t/c/5/f18dQhb0V1-gnj8fD6VyW2LL_8b2B9nMJN7t5XWPf2rmRW2Bpn224XrfJdW16gGCb89l_0Q101?te=W3R5hFj4cm2zwW3X-qTw3ZVc6BW3JFvSV3CfBPBW4fdHZS3_rjd5W45SB6d4cgzsKW4cQgwb3ZrXZbW3JF4nf3CfBPBW4fdh-T3z8nfwF41S2fpPbML1&si=8000000025871155&pi=fb193d5e-cb52-4165-b27e-c46a92837def][HOW TO Link]]
* MEETING with Taco Tuesdays                                        :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-03 Wed 11:08]--[2023-05-03 Wed 11:15] =>  0:07
:END:
[2023-05-03 Wed 11:08]

- Taco tuesdays are tech and teaching
- 1 client per sales guy as a quota
- This upcoming one:
  - Ground support - Setup 2 coloumns
  - Led wall with ground support
  - S Curve LED
    

* DONE Meet with Phil Mershon re Keynote
CLOSED: [2023-05-03 Wed 17:23] SCHEDULED: <2023-05-03 Wed 16:30>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-03 Wed 16:31]--[2023-05-03 Wed 17:23] =>  0:52
:END:
 [2023-05-03 Wed 15:51]
* DONE Update Agenda & Tasks
CLOSED: [2023-05-04 Thu 13:13] SCHEDULED: <2023-05-04 Thu 11:15>
:PROPERTIES:
:Effort:   2:00
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-04 Thu 11:13]--[2023-05-04 Thu 13:13] =>  2:00
:END:
 [2023-05-03 Wed 15:52]


* DONE Meet with Jeff re Hubspot
CLOSED: [2023-05-03 Wed 16:22] SCHEDULED: <2023-05-03 Wed 15:55>
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-03 Wed 15:57]--[2023-05-03 Wed 16:22] =>  0:25
:END:
 [2023-05-03 Wed 15:54]


* DONE Meet with Michael
CLOSED: [2023-05-05 Fri 15:11] SCHEDULED: <2023-05-05 Fri 14:15>
:PROPERTIES:
:Effort:   0:30
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-05 Fri 14:15]--[2023-05-05 Fri 15:10] =>  0:00
:END:
 [2023-05-04 Thu 10:56]


* DONE Plan out May
CLOSED: [2023-05-05 Fri 13:10] SCHEDULED: <2023-05-05 Fri 11:00>
:PROPERTIES:
:Effort:   1:30
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-05 Fri 12:04]--[2023-05-05 Fri 13:10] =>  1:06
CLOCK:  [2023-05-05 Fri 11:00]
:END:
[2023-05-05 Fri 11:00]


* DONE Lunch
CLOSED: [2023-05-05 Fri 14:14] SCHEDULED: <2023-05-05 Fri 13:00>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-05 Fri 13:10]--[2023-05-05 Fri 14:14] =>  1:04
:END:
 [2023-05-05 Fri 11:13]


* DONE Finalize pricing sheet
CLOSED: [2023-05-10 Wed 16:46] SCHEDULED: <2023-05-10 Wed 13:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-10 Wed 13:32]--[2023-05-10 Wed 16:46] =>  3:14
CLOCK: [2023-05-09 Tue 12:41]--[2023-05-09 Tue 16:58] =>  4:17
- State "NEXT"       from "WAITING"    [2023-05-09 Tue 11:23]
- State "WAITING"    from "TODO"       [2023-05-05 Fri 11:41] \\
  Waiting on the data from Josh
:END:
 [2023-05-05 Fri 11:40]


* DONE Lunch
CLOSED: [2023-05-08 Mon 13:28] SCHEDULED: <2023-05-08 Mon 12:30>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-08 Mon 12:51]--[2023-05-08 Mon 13:28] =>  0:37
:END:
 [2023-05-05 Fri 11:56]


* DONE Clear out email
CLOSED: [2023-05-15 Mon 13:32] SCHEDULED: <2023-05-12 Fri 11:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-15 Mon 13:04]--[2023-05-15 Mon 13:32] =>  0:28
:END:
 [2023-05-05 Fri 12:34]


* MEETING with Proposify                                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-04 Thu 13:30]--[2023-05-04 Thu 13:45] =>  0:15
:END:
[2023-05-04 Thu 13:30]

Content table vs Fee Table. ($ won't show up in a content table.)

The tables can link but they must stay in the same "section" but can span multiple pages.

* MEETING 05/10 Managers                                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-10 Wed 09:05]--[2023-05-10 Wed 09:53] =>  0:48
:END:
[2023-05-10 Wed 09:05]

* MEETING  with Julie & Zack RE Phil Mershon Speaking Gig           :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-17 Wed 11:02]--[2023-05-17 Wed 12:21] =>  1:19
:END:
[2023-05-17 Wed 11:02]

Email Frequency?

Who attended which 

- Who are we emailing within the
- Up to 5k

workflows
- Remove do not contact from marketing contact as a workflow item.
- As people are added always make them a marketing contact.
- If cold lead + george is owner + no response
- Active marketing cold leads list
- Active marketing everyone else

- First email blast is not cold leads
  

  - Add more contact limit
  - Clean contact types & make it required
  - Update sales guys on the use of Other as contact type
  - create our lists for this event cold leads & non cold leads
  - Clean up George's bulk imports
  - Create the Campaign
  - Blast non-cold leads
  - hit cold leads on the next one (friday)

  - Check & Update first / last name across contacts

  - Figure out how to update the default "about" section for hubspot plugin in gmail

  - Agency
  - End Client
  - Event planner
  - Event producer
  - event promoter
  - Non Profit
  - University



  

* MEETING with Josh RE purchases for Broadcast room                 :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-07-03 Mon 14:13
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-05-17 Wed 14:56]--[2023-05-17 Wed 15:46] =>  0:50
:END:
[2023-05-17 Wed 14:56]

** DONE Setup webpage for streaming 
CLOSED: [2023-06-14 Wed 17:17] SCHEDULED: <2023-06-14 Wed 10:30>
:PROPERTIES:
:Effort:   2:00
:END:
:LOGBOOK:
CLOCK: [2023-06-14 Wed 15:21]--[2023-06-14 Wed 17:17] =>  1:56
CLOCK: [2023-06-14 Wed 10:22]--[2023-06-14 Wed 11:00] =>  0:38
:END:
 [2023-06-14 Wed 10:20]


* MEETING with Julies & Syd - Final Meeting to go over Phil Mershon event. :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-12 Mon 07:31]--[2023-06-12 Mon 08:45] =>  1:14
:END:
[2023-06-12 Mon 11:31]

- Count tables
- Count chairs
- Store trip tuesday for drink stuff
- Sign In sheet
- Name tags
- Confirm Erica (josh is bartending)
- Build a website for stream
- Cnfirm employee attmendance
- sean & ruben handling technical setup wed
- sweep vacumm the studio
- 

* DONE Fill in worksheet for Hubspot/Quickbooks
CLOSED: [2023-06-28 Wed 16:35] SCHEDULED: <2023-06-27 Tue 14:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-28 Wed 14:07]--[2023-06-28 Wed 16:35] =>  2:28
CLOCK: [2023-06-28 Wed 011:50]--[2023-06-28 Wed 12:40] => 12:40
CLOCK: [2023-06-27 Tue 14:17]--[2023-06-27 Tue 16:05] =>  1:48

:END:
 [2023-06-20 Tue 14:38]
[[https://docs.google.com/spreadsheets/d/1_odjTvrWsuGkNNBSHXfqa5XAsw5P518I0wAzM4H9ydk/edit#gid=1108629813][Hubspot / Quickbooks Worksheet]]

* MEETING with Nick Michael & Julie re: Package Pricing             :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-16 Fri 10:03]--[2023-06-16 Fri 10:43] =>  0:40
:END:
[2023-06-16 Fri 10:03]


Behr - 170k / 85k

- General Session Package
- Breakout package
- Pre-Function Space
- 
  

* MEETING with Sales Team                                           :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-16 Fri 08:23]--[2023-06-16 Fri 09:05] =>  0:42
:END:
[2023-06-16 Fri 08:23]

- Get 2 more cameras
- Get power supplies
- Send Nick photos. 

* MEETING with Justin & Zack - Hubspot revenue tracking             :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-19 Mon 10:12]--[2023-06-19 Mon 11:15] =>  1:03
:END:
[2023-06-19 Mon 10:12]

Total Amount in company currency -
Intial Budget
Starting Amount - > workflow to make sure initial numbers

* MEETING with SEAS Team [Manager Meeting]                          :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-19 Mon 12:12]--[2023-06-19 Mon 13:04] =>  0:52
:END:
[2023-06-19 Mon 12:12]


* MEETING with SEAS Team [Manager Meeting]                          :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-19 Mon 12:12]--[2023-06-19 Mon 13:04] =>  0:52
:END:
[2023-06-19 Mon 12:12]

* MEETING marketing meeting with Troy Julie Zack                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-28 Wed 13:28]--[2023-06-28 Wed 14:06] =>  0:38
:END:
[2023-06-28 Wed 13:28]
* MEETING with Sales Team (weekly sales meeting)                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-30 Fri 08:03]--[2023-06-30 Fri 08:56] =>  0:53
:END:
[2023-06-30 Fri 08:03]


* MEETING with Sales Team (weekly sales meeting)                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-01 Tue 15:47
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: SEAS
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-30 Fri 08:03]--[2023-06-30 Fri 08:56] =>  0:53
:END:
[2023-06-30 Fri 08:03]

* DONE Location Based Deal report
CLOSED: [2023-06-29 Thu 11:36] SCHEDULED: <2023-06-29 Thu 10:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-08-14 Mon 15:14
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks/BridgeRev Hubspot Setup
:ARCHIVE_CATEGORY: Project
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-06-29 Thu 10:05]--[2023-06-29 Thu 11:36] =>  1:31
:END:


** DONE Create Signature for Ruben
CLOSED: [2023-05-08 Mon 11:41] SCHEDULED: <2023-05-08 Mon 11:00>
:LOGBOOK:
CLOCK: [2023-05-08 Mon 11:10]--[2023-05-08 Mon 11:41] =>  0:31
:END:

** DONE Create Signature for Craig
CLOSED: [2023-07-17 Mon 15:45] SCHEDULED: <2023-07-18 Tue 10:30>
:LOGBOOK:
CLOCK: [2023-06-27 Tue 14:15]--[2023-06-27 Tue 14:17] =>  0:02
- State "NEXT"       from "WAITING"    [2023-06-12 Mon 00:52]
- State "WAITING"    from "TODO"       [2023-05-05 Fri 11:55] \\
  Waiting on photo from Julie
:END:

* DONE Update Signatures
CLOSED: [2023-07-17 Mon 15:44] SCHEDULED: <2023-07-17 Mon 12:15>
:PROPERTIES:
:Effort:   2:00
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-17 Mon 13:26]--[2023-07-17 Mon 15:44] =>  2:18
:END:
 [2023-07-13 Thu 11:36]

- [X] Zack
- [X] Troy
- [X] Mitch
- [X] Jeff


* DONE Plan the Day
CLOSED: [2023-07-17 Mon 11:42] SCHEDULED: <2023-07-17 Mon 11:40>
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-17 Mon 11:37]--[2023-07-17 Mon 11:42] =>  0:05
CLOCK: [2023-07-17 Mon 11:37]--[2023-07-17 Mon 11:37] =>  0:00
:END:
 [2023-07-17 Mon 11:37]


* DONE Clean Up Project Files on PC
CLOSED: [2023-07-18 Tue 14:11] SCHEDULED: <2023-07-18 Tue 11:15>
:PROPERTIES:
:Effort:   1:00
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-17 Mon 15:46]--[2023-07-17 Mon 16:30] =>  0:44
:END:
 [2023-07-17 Mon 11:38]


* DONE Edit Lasso Podcast
CLOSED: [2023-07-26 Wed 17:17] SCHEDULED: <2023-07-26 Wed 13:45>
:PROPERTIES:
:Effort:   2:00
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-26 Wed 16:54]--[2023-07-26 Wed 17:17] =>  0:23
:END:
 [2023-07-17 Mon 11:39]


* DONE Lunch
CLOSED: [2023-07-17 Mon 12:13] SCHEDULED: <2023-07-17 Mon 11:45>
:PROPERTIES:
:Effort:   0:30
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-17 Mon 11:42]--[2023-07-17 Mon 12:13] =>  0:31
:END:
 [2023-07-17 Mon 11:41]


* DONE Lunch
CLOSED: [2023-07-19 Wed 14:19] SCHEDULED: <2023-07-19 Wed 12:30>
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-19 Wed 13:59]--[2023-07-19 Wed 14:19] =>  0:20
CLOCK: [2023-07-19 Wed 12:36]--[2023-07-19 Wed 13:59] =>  1:23
:END:
 [2023-07-19 Wed 11:44]


* DONE Trouble shoot Julies PC
CLOSED: [2023-07-26 Wed 13:45]
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-26 Wed 11:30]--[2023-07-26 Wed 13:00] =>  1:30
:END:
 [2023-07-26 Wed 13:44]


* MEETING with                                                      :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-06 Thu 09:00]--[2023-07-06 Thu 10:10] =>  1:10
:END:
[2023-07-06 Thu 09:00]

* MEETING with Managers                                             :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-14 Fri 10:58]--[2023-07-14 Fri 12:09] =>  1:11
:END:
[2023-07-14 Fri 10:58]

* MEETING with Justin & Zack RE QB Invoicing                        :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-18 Tue 14:28]--[2023-07-18 Tue 15:38] =>  1:10
:END:
[2023-07-18 Tue 14:28]


* MEETING with Proposify                                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-25 Tue 09:57]--[2023-07-25 Tue 11:05] =>  1:08
:END:
[2023-07-25 Tue 09:57]
Bunch of shit i didn't care about because proposify


* MEETING with Ryan Saucerman RE backing up data                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-26 Wed 13:00]--[2023-07-26 Wed 13:40] =>  0:40
:END:
[2023-07-26 Wed 13:45]

- Need to order
  - [[https://www.amazon.com/StarTech-com-M-2-2-5in-SATA-Adapter/dp/B00ITJ7U20/ref=sr_1_2?crid=3S6PT1XJBD4MO&keywords=m2%2Bto%2Bsata%2Badapter&qid=1690396661&sprefix=m2%2Bto%2B%2Caps%2C164&sr=8-2&th=1][NVME to Sata adapater]]
  - [[https://www.amazon.com/Sabrent-External-Docking-Supports-DS-UTC1/dp/B07CSG4XM4/ref=sr_1_3?crid=Y2D5QIPMNJTA&keywords=external%2Busb%2Bdrive%2Bdock&qid=1690396633&sprefix=external%2Busb%2Bdrive%2Bdock%2Caps%2C181&sr=8-3&th=1][Docking bay USB C]]


* MEETING with Marketing                                            :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-27 Thu 10:11]--[2023-07-27 Thu 10:47] =>  0:36
:END:
[2023-07-27 Thu 10:11]

* MEETING with Weekly Catch Up                                      :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-09-05 Tue 11:18
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-07-31 Mon 13:03]--[2023-07-31 Mon 13:26] =>  0:23
:END:
[2023-07-31 Mon 13:03]


*** DONE Post infocom video to Linkedin
CLOSED: [2023-06-29 Thu 13:51] SCHEDULED: <2023-06-29 Thu 12:45>
:LOGBOOK:
CLOCK: [2023-06-29 Thu 12:00]--[2023-06-29 Thu 13:51] =>  1:51
:END:
 [2023-06-29 Thu 11:40]

** DONE Review Resources from Bridge Rev
CLOSED: [2023-08-07 Mon 14:26] SCHEDULED: <2023-08-07 Mon 13:30>
:PROPERTIES:
:Effort:   1:00
:CATEGORY: Task
:END:
:LOGBOOK:
CLOCK: [2023-08-07 Mon 13:42]--[2023-08-07 Mon 14:26] =>  0:44
:END:

 [2023-05-03 Wed 15:23]

[[https://mail.google.com/mail/u/1/#search/from%3A(justin)/FMfcgzGsmNQBhsftwvRfcTNTtZZGXvCR][Email]]

** DONE Location Based Deal report
CLOSED: [2023-06-29 Thu 11:36] SCHEDULED: <2023-06-29 Thu 10:30>
:LOGBOOK:
CLOCK: [2023-06-29 Thu 10:05]--[2023-06-29 Thu 11:36] =>  1:31
:END:


* DONE Prep for marketing meeting
CLOSED: [2023-08-02 Wed 09:56] SCHEDULED: <2023-08-02 Wed 09:30>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-10-01 Sun 23:39
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-02 Wed 09:29]--[2023-08-02 Wed 09:56] =>  0:27
:END:
 [2023-08-02 Wed 09:29]


* DONE Create new Hubspot Graph
CLOSED: [2023-08-14 Mon 09:48] SCHEDULED: <2023-08-14 Mon>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-10-01 Sun 23:39
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-14 Mon 09:14]--[2023-08-14 Mon 09:48] =>  0:34
:END:
 [2023-08-14 Mon 08:38]

shows won deals per month in one color
shows almost certain deals in another color
shows certain deals in another color
gives us a total per month

should look like the Won Deals by Month (Events/Rental


* DONE Create report that shows YTD Events Rentals won vs last year YTD
CLOSED: [2023-08-14 Mon 09:07] SCHEDULED: <2023-08-14 Mon>
:PROPERTIES:
:CATEGORY: Task
:ARCHIVE_TIME: 2023-10-01 Sun 23:39
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Tasks
:ARCHIVE_CATEGORY: Task
:ARCHIVE_TODO: DONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-14 Mon 08:40]--[2023-08-14 Mon 09:07] =>  0:27
:END:
 [2023-08-14 Mon 08:39]
 When i create a report and show for example a line chart i can activate the display option compared to year before. That's the option i searched.


* MEETING with Troy/Zack/Julie re: Weekly Marketing Meeting         :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-10-01 Sun 23:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-02 Wed 09:57]--[2023-08-02 Wed 10:51] =>  0:54
:END:
[2023-08-02 Wed 09:57]

* MEETING with Weekly Catchup                                       :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-10-01 Sun 23:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-07 Mon 13:04]--[2023-08-07 Mon 13:10] =>  0:06
:END:
[2023-08-07 Mon 13:04]

* MEETING with Clint re:Podcast                                     :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-10-01 Sun 23:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-15 Tue 08:30]--[2023-08-15 Tue 08:43] =>  0:13
:END:
[2023-08-15 Tue 08:30]

* MEETING with Marketing Meeting                                    :MEETING:
:PROPERTIES:
:ARCHIVE_TIME: 2023-10-01 Sun 23:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Meetings
:ARCHIVE_CATEGORY: Meeting
:ARCHIVE_TODO: MEETING
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-31 Thu 10:11]--[2023-08-31 Thu 11:20] =>  1:09
:END:
[2023-08-31 Thu 10:11]

* PHONE Alpha Graphics re: Business cards                             :PHONE:
:PROPERTIES:
:ARCHIVE_TIME: 2023-10-01 Sun 23:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Phone Calls
:ARCHIVE_CATEGORY: phone
:ARCHIVE_TODO: PHONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-01 Tue 13:23]--[2023-08-01 Tue 13:36] =>  0:13
:END:
[2023-08-01 Tue 13:23]

* PHONE w/ Kyle re: Tiki Oasis                                        :PHONE:
:PROPERTIES:
:ARCHIVE_TIME: 2023-10-01 Sun 23:40
:ARCHIVE_FILE: ~/Orgfiles/SEAS.org
:ARCHIVE_OLPATH: Phone Calls
:ARCHIVE_CATEGORY: phone
:ARCHIVE_TODO: PHONE
:ARCHIVE_ITAGS: SEAS
:END:
:LOGBOOK:
CLOCK: [2023-08-02 Wed 11:35]--[2023-08-02 Wed 11:53] =>  0:18
:END:
[2023-08-02 Wed 11:35]

